Repository: batonogov/pine
Catalog: Pine/Localizable.xcstrings
Source language: en
Languages: de, es, fr, ja, ko, pt_br, ru, zh_hans

# %@ — line %lld
source: %1$@ — line %2$lld
de: %1$@ — Zeile %2$lld
es: %1$@ — línea %2$lld
fr: %1$@ — ligne %2$lld
ja: %1$@ — %2$lld行
ko: %1$@ — %2$lld행
pt_br: %1$@ — linha %2$lld
ru: %1$@ — строка %2$lld
zh_hans: %1$@ — 第 %2$lld 行

source: 42 or 42:10
de: 42 oder 42:10
es: 42 o 42:10
fr: 42 ou 42:10
ja: 42 または 42:10
ko: 42 또는 42:10
pt_br: 42 ou 42:10
ru: 42 или 42:10
zh_hans: 42 或 42:10

source: About Pine
de: Über Pine
es: Acerca de Pine
fr: À propos de Pine
ja: Pine について
ko: Pine 정보
pt_br: Sobre o Pine
ru: О Pine
zh_hans: 关于 Pine

# about.tagline
source: A code editor that belongs on your Mac.
de: Ein Code-Editor, der auf Ihren Mac gehört.
es: Un editor de código hecho para tu Mac.
fr: Un éditeur de code fait pour votre Mac.
ja: あなたのMacにふさわしいコードエディタ。
ko: 당신의 Mac에 어울리는 코드 편집기.
pt_br: Um editor de código feito para o seu Mac.
ru: Редактор кода, созданный для вашего Mac.
zh_hans: 属于你 Mac 的代码编辑器。

# agent.liveness.stale
source: Stale
de: Veraltet
es: Desactualizada
fr: Obsolète
ja: 古い
ko: 오래됨
pt_br: Desatualizada
ru: Устарела
zh_hans: 已过期

# agent.liveness.terminated
source: Terminated
de: Beendet
es: Finalizada
fr: Terminée
ja: 終了
ko: 종료됨
pt_br: Encerrada
ru: Завершена
zh_hans: 已终止

# agent.resumeTask
source: Resume Agent Task
de: Agent-Aufgabe fortsetzen
es: Reanudar tarea del agente
fr: Reprendre la tâche de l’agent
ja: エージェントタスクを再開
ko: 에이전트 작업 재개
pt_br: Retomar tarefa do agente
ru: Возобновить задачу агента
zh_hans: 恢复智能体任务

# agentCompletion.agentReport
source: Agent report
de: Agentenbericht
es: Informe del agente
fr: Rapport de l’agent
ja: エージェントの報告
ko: 에이전트 보고
pt_br: Relatório do agente
ru: Отчёт агента
zh_hans: 智能体报告

# agentCompletion.changes
source: Changes
de: Änderungen
es: Cambios
fr: Modifications
ja: 変更
ko: 변경 사항
pt_br: Alterações
ru: Изменения
zh_hans: 更改

# agentCompletion.commands
source: Commands and checks
de: Befehle und Prüfungen
es: Comandos y comprobaciones
fr: Commandes et vérifications
ja: コマンドと確認
ko: 명령 및 확인
pt_br: Comandos e verificações
ru: Команды и проверки
zh_hans: 命令和检查

# agentCompletion.evidence.agentReported
source: Agent-reported
de: Vom Agenten gemeldet
es: Informado por el agente
fr: Signalé par l’agent
ja: エージェント報告
ko: 에이전트 보고
pt_br: Relatado pelo agente
ru: Со слов агента
zh_hans: 智能体报告

# agentCompletion.evidence.observed
source: Observed
de: Beobachtet
es: Observado
fr: Observé
ja: 観測済み
ko: 관찰됨
pt_br: Observado
ru: Наблюдалось
zh_hans: 已观察

# agentCompletion.gap.changes
source: No file changes have verified attribution.
de: Keine Dateiänderungen haben eine verifizierte Zuordnung.
es: Ningún cambio de archivo tiene atribución verificada.
fr: Aucune modification de fichier n’a d’attribution vérifiée.
ja: 検証済みの帰属を持つファイル変更はありません。
ko: 검증된 귀속이 있는 파일 변경이 없습니다.
pt_br: Nenhuma alteração de arquivo tem atribuição verificada.
ru: Нет изменений файлов с подтверждённой атрибуцией.
zh_hans: 没有文件更改具有已验证归属。

# agentCompletion.gap.commands
source: No commands have structured evidence.
de: Keine Befehle haben strukturierte Nachweise.
es: Ningún comando tiene evidencia estructurada.
fr: Aucune commande ne dispose de preuves structurées.
ja: 構造化された証拠を持つコマンドはありません。
ko: 구조화된 증거가 있는 명령이 없습니다.
pt_br: Nenhum comando tem evidência estruturada.
ru: Нет команд со структурированными доказательствами.
zh_hans: 没有命令具有结构化证据。

# agentCompletion.gap.overlaps %lld
source: %lld files have overlapping or ambiguous edits.
de: %lld Dateien enthalten überlappende oder mehrdeutige Änderungen.
es: %lld archivos tienen ediciones superpuestas o ambiguas.
fr: %lld fichiers ont des modifications qui se chevauchent ou sont ambiguës.
ja: %lld 個のファイルに重複または曖昧な編集があります。
ko: %lld개 파일에 겹치거나 모호한 편집이 있습니다.
pt_br: %lld arquivos têm edições sobrepostas ou ambíguas.
ru: В %lld файлах есть пересекающиеся или неоднозначные правки.
zh_hans: %lld 个文件存在重叠或不明确的编辑。

# agentCompletion.gap.provenance
source: Structured provenance is unavailable.
de: Strukturierte Herkunftsdaten sind nicht verfügbar.
es: La procedencia estructurada no está disponible.
fr: La provenance structurée n’est pas disponible.
ja: 構造化された来歴情報は利用できません。
ko: 구조화된 출처 정보를 사용할 수 없습니다.
pt_br: A proveniência estruturada não está disponível.
ru: Структурированные данные о происхождении недоступны.
zh_hans: 结构化来源信息不可用。

# agentCompletion.gap.recovered
source: Provenance was recovered and may be incomplete.
de: Die Herkunftsdaten wurden wiederhergestellt und können unvollständig sein.
es: La procedencia se recuperó y puede estar incompleta.
fr: La provenance a été récupérée et peut être incomplète.
ja: 来歴情報は復旧されましたが、不完全な可能性があります。
ko: 출처 정보가 복구되었으며 불완전할 수 있습니다.
pt_br: A proveniência foi recuperada e pode estar incompleta.
ru: Данные о происхождении восстановлены и могут быть неполными.
zh_hans: 来源信息已恢复，但可能不完整。

# agentCompletion.gap.statistics %lld
source: Exact diff statistics are unavailable for %lld files.
de: Für %lld Dateien sind keine exakten Diff-Statistiken verfügbar.
es: Las estadísticas exactas del diff no están disponibles para %lld archivos.
fr: Les statistiques exactes du diff ne sont pas disponibles pour %lld fichiers.
ja: %lld 個のファイルでは正確な差分統計を利用できません。
ko: %lld개 파일의 정확한 diff 통계를 사용할 수 없습니다.
pt_br: As estatísticas exatas do diff não estão disponíveis para %lld arquivos.
ru: Для %lld файлов точная статистика diff недоступна.
zh_hans: %lld 个文件无法获得精确差异统计。

# agentCompletion.gap.tests
source: No successful test run has verified evidence.
de: Kein erfolgreicher Testlauf hat verifizierte Nachweise.
es: Ninguna ejecución de pruebas correcta tiene evidencia verificada.
fr: Aucune exécution de tests réussie ne dispose de preuves vérifiées.
ja: 検証済みの証拠を持つ成功したテスト実行はありません。
ko: 검증된 증거가 있는 성공한 테스트 실행이 없습니다.
pt_br: Nenhuma execução de teste bem-sucedida tem evidência verificada.
ru: Нет успешных запусков тестов с подтверждёнными доказательствами.
zh_hans: 没有成功的测试运行具有已验证证据。

# agentCompletion.gaps
source: Evidence gaps
de: Nachweislücken
es: Vacíos de evidencia
fr: Lacunes des preuves
ja: 証拠の不足
ko: 증거 공백
pt_br: Lacunas de evidência
ru: Пробелы в доказательствах
zh_hans: 证据缺口

# agentCompletion.noChanges
source: No attributable file changes.
de: Keine zuordenbaren Dateiänderungen.
es: No hay cambios de archivo atribuibles.
fr: Aucune modification de fichier attribuable.
ja: 帰属可能なファイル変更はありません。
ko: 귀속 가능한 파일 변경이 없습니다.
pt_br: Nenhuma alteração de arquivo atribuível.
ru: Нет атрибутируемых изменений файлов.
zh_hans: 没有可归属的文件更改。

# agentCompletion.noCommands
source: No command evidence was recorded.
de: Keine Befehlsnachweise aufgezeichnet.
es: No se registró evidencia de comandos.
fr: Aucune preuve de commande n’a été enregistrée.
ja: コマンドの証拠は記録されていません。
ko: 명령 증거가 기록되지 않았습니다.
pt_br: Nenhuma evidência de comando foi registrada.
ru: Доказательства выполнения команд не записаны.
zh_hans: 未记录命令证据。

# agentCompletion.overlap
source: Overlapping or ambiguous writers
de: Überlappende oder mehrdeutige Bearbeiter
es: Autores superpuestos o ambiguos
fr: Auteurs qui se chevauchent ou sont ambigus
ja: 重複または曖昧な編集者
ko: 겹치거나 모호한 작성자
pt_br: Autores sobrepostos ou ambíguos
ru: Пересекающиеся или неоднозначные авторы
zh_hans: 重叠或不明确的编辑者

# agentCompletion.showButton
source: Completion brief
de: Abschlussbericht
es: Resumen de finalización
fr: Rapport de fin
ja: 完了概要
ko: 완료 요약
pt_br: Resumo da conclusão
ru: Итоговый отчёт
zh_hans: 完成摘要

# agentCompletion.title
source: Agent Completion Brief
de: Abschlussbericht des Agenten
es: Resumen de finalización del agente
fr: Rapport de fin de l’agent
ja: エージェント完了概要
ko: 에이전트 완료 요약
pt_br: Resumo da conclusão do agente
ru: Итоговый отчёт агента
zh_hans: 智能体完成摘要

# agentCompletion.verification
source: Verification
de: Verifizierung
es: Verificación
fr: Vérification
ja: 検証
ko: 검증
pt_br: Verificação
ru: Проверка
zh_hans: 验证

# agentCompletion.verifiedTests %lld
source: %lld verified test runs
de: %lld verifizierte Testläufe
es: %lld ejecuciones de pruebas verificadas
fr: %lld exécutions de tests vérifiées
ja: 検証済みテスト実行 %lld 件
ko: 검증된 테스트 실행 %lld개
pt_br: %lld execuções de teste verificadas
ru: Подтверждённых запусков тестов: %lld
zh_hans: %lld 次已验证测试运行

# agentHistory.emptyMessage
source: Finished agent sessions and observed file activity will appear here. Heuristic entries are review-only.
de: Abgeschlossene Agenten-Sitzungen und beobachtete Dateiaktivitäten erscheinen hier. Heuristische Einträge dienen nur zur Überprüfung.
es: Las sesiones de agente finalizadas y la actividad de archivos observada aparecerán aquí. Las entradas heurísticas son solo para revisión.
fr: Les sessions d'agent terminées et l'activité de fichiers observée apparaîtront ici. Les entrées heuristiques sont en lecture seule.
ja: 終了したエージェントセッションと観測されたファイル操作がここに表示されます。推定に基づく項目は確認専用です。
ko: 완료된 에이전트 세션과 관찰된 파일 활동이 여기에 표시됩니다. 휴리스틱 항목은 검토 전용입니다.
pt_br: Sessões de agente finalizadas e a atividade de arquivos observada aparecerão aqui. Entradas heurísticas servem apenas para revisão.
ru: Завершённые сессии агента и наблюдаемая файловая активность появятся здесь. Эвристические записи доступны только для просмотра.
zh_hans: 已完成的智能体会话和观察到的文件活动将显示在此处。启发式条目仅供查看。

# agentHistory.emptyTitle
source: No History Yet
de: Noch kein Verlauf
es: Aún no hay historial
fr: Aucun historiel
ja: 履歴はまだありません
ko: 기록 없음
pt_br: Sem histórico
ru: Истории пока нет
zh_hans: 暂无历史

# agentHistory.revertButton
source: Revert
de: Zurücksetzen
es: Revertir
fr: Annuler
ja: 取り消す
ko: 되돌리기
pt_br: Reverter
ru: Отменить
zh_hans: 撤销

# agentHistory.revertConfirmAction
source: Revert
de: Zurücksetzen
es: Revertir
fr: Annuler
ja: 取り消す
ko: 되돌리기
pt_br: Reverter
ru: Отменить
zh_hans: 撤销

# agentHistory.revertConfirmMessage
source: This runs git checkout on the run's files, discarding the agent's changes. This cannot be undone.
de: Dies führt „git checkout“ für die Dateien des Durchlaufs aus und verwirft die Änderungen des Agenten. Das kann nicht rückgängig gemacht werden.
es: Esto ejecuta git checkout en los archivos de la ejecución, descartando los cambios del agente. No se puede deshacer.
fr: Cela exécute git checkout sur les fichiers de l'exécution, annulant les modifications de l'agent. Action irréversible.
ja: 実行のファイルに対して git checkout を実行し、エージェントの変更を破棄します。この操作は元に戻せません。
ko: 실행의 파일에 대해 git checkout을 실행하여 에이전트의 변경 사항을 폐기합니다. 이 작업은 취소할 수 없습니다.
pt_br: Isso executa git checkout nos arquivos da execução, descartando as alterações do agente. Não pode ser desfeito.
ru: Это выполнит git checkout для файлов запуска, отбросив изменения агента. Действие необратимо.
zh_hans: 这会对该运行的文件执行 git checkout，丢弃智能体的更改。此操作无法撤销。

# agentHistory.revertConfirmTitle
source: Revert Agent Changes?
de: Agenten-Änderungen zurücksetzen?
es: ¿Revertir los cambios del agente?
fr: Annuler les modifications de l'agent ?
ja: エージェントの変更を取り消しますか？
ko: 에이전트 변경 사항을 되돌리시겠습니까?
pt_br: Reverter as alterações do agente?
ru: Отменить изменения агента?
zh_hans: 撤销智能体的更改？

# agentHistory.revertPartialFailure
source: Some files could not be reverted. Check that this is a git repository.
de: Einige Dateien konnten nicht zurückgesetzt werden. Prüfe, ob dies ein Git-Repository ist.
es: No se pudieron revertir algunos archivos. Comprueba que este sea un repositorio git.
fr: Certains fichiers n'ont pas pu être annulés. Vérifiez qu'il s'agit d'un dépôt git.
ja: 一部のファイルを取り消せませんでした。ここが git リポジトリか確認してください。
ko: 일부 파일을 되돌릴 수 없습니다. 여기가 git 저장소인지 확인하세요.
pt_br: Alguns arquivos não puderam ser revertidos. Verifique se este é um repositório git.
ru: Не удалось отменить некоторые файлы. Убедитесь, что это git-репозиторий.
zh_hans: 部分文件无法撤销。请检查这是否是一个 git 仓库。

# agentHistory.checkedRevertConfirmMessage
source: This restores the exact state recorded before the agent's changes. Files edited since the agent ran are left untouched. This cannot be undone.
de: Dadurch wird der genaue Zustand vor den Änderungen des Agenten wiederhergestellt. Danach bearbeitete Dateien bleiben unangetastet. Dies kann nicht rückgängig gemacht werden.
es: Esto restaura el estado exacto registrado antes de los cambios del agente. Los archivos editados desde la ejecución del agente no se modifican. No se puede deshacer.
fr: Cela restaure l'état exact enregistré avant les modifications de l'agent. Les fichiers modifiés depuis l'exécution de l'agent ne sont pas touchés. Action irréversible.
ja: エージェントの変更前の正確な記録状態を復元します。エージェント実行後に編集されたファイルはそのまま残ります。この操作は取り消せません。
ko: 에이전트 변경 전에 기록된 정확한 상태로 복원합니다. 에이전트 실행 이후에 편집된 파일은 그대로 유지됩니다. 이 작업은 되돌릴 수 없습니다.
pt_br: Isso restaura o estado exato registrado antes das alterações do agente. Arquivos editados desde a execução do agente não são modificados. Isso não pode ser desfeito.
ru: Это восстанавливает точное состояние, записанное до изменений агента. Файлы, изменённые после запуска агента, остаются нетронутыми. Действие необратимо.
zh_hans: 这将恢复代理更改之前记录的确切状态。代理运行后编辑的文件保持不变。此操作无法撤销。

# agentHistory.checkedRevertSuccess
source: Agent changes reverted to their recorded before-state.
de: Agentur-Änderungen wurden auf den aufgezeichneten Vorher-Zustand zurückgesetzt.
es: Los cambios del agente se revirtieron a su estado anterior registrado.
fr: Les modifications de l'agent ont été rétablies à leur état antérieur enregistré.
ja: エージェントの変更を記録された以前の状態に戻しました。
ko: 에이전트 변경 사항이 기록된 이전 상태로 되돌려졌습니다.
pt_br: As alterações do agente foram revertidas ao estado anterior registrado.
ru: Изменения агента отменены до записанного предыдущего состояния.
zh_hans: 代理更改已恢复到记录的之前状态。

# agentHistory.recoveryNoticeAuthorityConsumed
source: Undo authority consumed
de: Undo-Berechtigung verbraucht
es: Autorización de deshacer consumida
fr: Autorisation d’annulation consommée
ja: 元に戻す権限を使用済み
ko: 실행 취소 권한 사용됨
pt_br: Autorização de desfazer consumida
ru: Разрешение на отмену использовано
zh_hans: 撤销授权已使用

# agentHistory.recoveryNoticeCorrupt
source: Corrupt or untrusted recovery data
de: Beschädigte oder nicht vertrauenswürdige Wiederherstellungsdaten
es: Datos de recuperación dañados o no fiables
fr: Données de récupération endommagées ou non fiables
ja: 破損または信頼できない復旧データ
ko: 손상되었거나 신뢰할 수 없는 복구 데이터
pt_br: Dados de recuperação corrompidos ou não confiáveis
ru: Повреждённые или недоверенные данные восстановления
zh_hans: 损坏或不可信的恢复数据

# agentHistory.recoveryNoticeFinalized
source: Finalized transaction
de: Abgeschlossene Transaktion
es: Transacción finalizada
fr: Transaction finalisée
ja: 完了したトランザクション
ko: 완료된 트랜잭션
pt_br: Transação finalizada
ru: Завершённая транзакция
zh_hans: 已完成的事务

# agentHistory.recoveryNoticeInstruction
source: Pine never restores this data automatically. Inspect the listed private backups before removing them.
de: Pine stellt diese Daten niemals automatisch wieder her. Prüfen Sie die aufgeführten privaten Sicherungen, bevor Sie sie entfernen.
es: Pine nunca restaura estos datos automáticamente. Revisa las copias privadas indicadas antes de eliminarlas.
fr: Pine ne restaure jamais ces données automatiquement. Vérifiez les sauvegardes privées indiquées avant de les supprimer.
ja: Pine がこのデータを自動的に復元することはありません。削除する前に、表示されたプライベートバックアップを確認してください。
ko: Pine은 이 데이터를 자동으로 복원하지 않습니다. 삭제하기 전에 표시된 비공개 백업을 검토하세요.
pt_br: O Pine nunca restaura estes dados automaticamente. Inspecione os backups privados listados antes de removê-los.
ru: Pine никогда не восстанавливает эти данные автоматически. Проверьте указанные приватные резервные копии перед удалением.
zh_hans: Pine 绝不会自动恢复这些数据。请在移除前检查列出的私有备份。

# agentHistory.recoveryNoticePrepared
source: Prepared transaction
de: Vorbereitete Transaktion
es: Transacción preparada
fr: Transaction préparée
ja: 準備済みのトランザクション
ko: 준비된 트랜잭션
pt_br: Transação preparada
ru: Подготовленная транзакция
zh_hans: 已准备的事务

# agentHistory.recoveryNoticeTitle
source: Recovery data needs review
de: Wiederherstellungsdaten müssen geprüft werden
es: Los datos de recuperación requieren revisión
fr: Les données de récupération doivent être vérifiées
ja: 復旧データの確認が必要です
ko: 복구 데이터를 검토해야 합니다
pt_br: Os dados de recuperação precisam ser revisados
ru: Данные восстановления требуют проверки
zh_hans: 恢复数据需要检查

# agentHistory.recoveryBackup %@
source: Recovery backup: %@
de: Wiederherstellungssicherung: %@
es: Copia de recuperación: %@
fr: Sauvegarde de récupération : %@
ja: 復旧用バックアップ: %@
ko: 복구 백업: %@
pt_br: Backup de recuperação: %@
ru: Резервная копия для восстановления: %@
zh_hans: 恢复备份：%@

# agentHistory.retainedRecoveryFile %@
source: Retained recovery file: %@
de: Beibehaltene Wiederherstellungsdatei: %@
es: Archivo de recuperación conservado: %@
fr: Fichier de récupération conservé : %@
ja: 保持された復旧ファイル: %@
ko: 보존된 복구 파일: %@
pt_br: Arquivo de recuperação preservado: %@
ru: Сохранённый файл восстановления: %@
zh_hans: 保留的恢复文件：%@

# agentHistory.revertSuccess
source: Changes reverted to their committed state.
de: Änderungen wurden in den committeten Zustand zurückgesetzt.
es: Cambios revertidos a su estado confirmado.
fr: Modifications annulées vers leur état validé.
ja: 変更をコミットされた状態に戻しました。
ko: 변경 사항이 커밋된 상태로 되돌려졌습니다.
pt_br: Alterações revertidas para o estado commitado.
ru: Изменения возвращены к закоммиченному состоянию.
zh_hans: 更改已还原到已提交状态。

# agentHistory.revertedBadge
source: Reverted
de: Zurückgesetzt
es: Revertido
fr: Annulé
ja: 取り消し済み
ko: 되돌림
pt_br: Revertido
ru: Отменено
zh_hans: 已撤销

# agentHistory.title
source: Agent History
de: Agentenverlauf
es: Historial del agente
fr: Historique de l'agent
ja: エージェント履歴
ko: 에이전트 기록
pt_br: Histórico do agente
ru: История агента
zh_hans: 智能体历史

# agentHistory.reviewChangesButton
source: Review Changes
de: Änderungen prüfen
es: Revisar cambios
fr: Examiner les modifications
ja: 変更を確認
ko: 변경 사항 검토
pt_br: Revisar alterações
ru: Проверить изменения
zh_hans: 查看更改

# agentHistory.undoReview.title
source: Review Verified Undo
de: Verifiziertes Rückgängigmachen prüfen
es: Revisar deshacer verificado
fr: Examiner l’annulation vérifiée
ja: 検証済みの取り消しを確認
ko: 검증된 실행 취소 검토
pt_br: Revisar desfazer verificado
ru: Проверка подтверждённой отмены
zh_hans: 检查已验证的撤销

# agentHistory.undoReview.preparing
source: Preparing a safe preview…
de: Sichere Vorschau wird vorbereitet…
es: Preparando una vista previa segura…
fr: Préparation d’un aperçu sécurisé…
ja: 安全なプレビューを準備中…
ko: 안전한 미리보기를 준비하는 중…
pt_br: Preparando uma prévia segura…
ru: Подготовка безопасного предпросмотра…
zh_hans: 正在准备安全预览…

# agentHistory.undoReview.verified
source: This preview was built from verified, immutable file snapshots.
de: Diese Vorschau wurde aus verifizierten, unveränderlichen Dateisnapshots erstellt.
es: Esta vista previa se creó a partir de instantáneas de archivo verificadas e inmutables.
fr: Cet aperçu a été créé à partir d’instantanés de fichiers vérifiés et immuables.
ja: このプレビューは、検証済みの不変ファイルスナップショットから作成されました。
ko: 이 미리보기는 검증된 불변 파일 스냅샷에서 생성되었습니다.
pt_br: Esta prévia foi criada a partir de snapshots de arquivos verificados e imutáveis.
ru: Предпросмотр построен по проверенным неизменяемым снимкам файлов.
zh_hans: 此预览由已验证且不可变的文件快照生成。

# agentHistory.undoReview.technicalDetails
source: Technical Details
de: Technische Details
es: Detalles técnicos
fr: Détails techniques
ja: 技術的な詳細
ko: 기술 세부 정보
pt_br: Detalhes técnicos
ru: Технические сведения
zh_hans: 技术详情

# agentHistory.undoReview.apply
source: Apply Undo
de: Rückgängig anwenden
es: Aplicar deshacer
fr: Appliquer l’annulation
ja: 取り消しを適用
ko: 실행 취소 적용
pt_br: Aplicar desfazer
ru: Применить отмену
zh_hans: 应用撤销

# agentHistory.undoReview.revalidated
source: Revalidated for apply
de: Für die Anwendung erneut geprüft
es: Revalidado para aplicar
fr: Revalidé pour l’application
ja: 適用前に再検証済み
ko: 적용을 위해 다시 검증됨
pt_br: Revalidado para aplicação
ru: Повторно проверено перед применением
zh_hans: 已重新验证，可应用

# agentHistory.undoReview.staleTitle
source: Undo Is No Longer Safe
de: Rückgängigmachen ist nicht mehr sicher
es: Deshacer ya no es seguro
fr: L’annulation n’est plus sûre
ja: 取り消しは安全ではありません
ko: 더 이상 안전하게 실행 취소할 수 없음
pt_br: Desfazer não é mais seguro
ru: Отмена больше небезопасна
zh_hans: 撤销操作已不再安全

# agentHistory.undoReview.content.binary
source: Binary content — line preview unavailable
de: Binärinhalt — keine Zeilenvorschau verfügbar
es: Contenido binario — vista previa por líneas no disponible
fr: Contenu binaire — aperçu par ligne indisponible
ja: バイナリ内容 — 行プレビューは利用できません
ko: 바이너리 콘텐츠 — 줄 미리보기 사용 불가
pt_br: Conteúdo binário — prévia por linha indisponível
ru: Двоичные данные — построчный просмотр недоступен
zh_hans: 二进制内容 — 无法提供逐行预览

# agentHistory.undoReview.content.omitted
source: Text preview omitted because the file is too large
de: Textvorschau wegen der Dateigröße ausgelassen
es: Vista previa de texto omitida porque el archivo es demasiado grande
fr: Aperçu du texte omis car le fichier est trop volumineux
ja: ファイルが大きすぎるためテキストプレビューを省略しました
ko: 파일이 너무 커서 텍스트 미리보기를 생략함
pt_br: Prévia de texto omitida porque o arquivo é muito grande
ru: Текстовый предпросмотр скрыт из-за размера файла
zh_hans: 文件过大，已省略文本预览

# agentHistory.undoReview.failure.entryNotFound
source: This history entry no longer exists.
de: Dieser Verlaufseintrag ist nicht mehr vorhanden.
es: Esta entrada del historial ya no existe.
fr: Cette entrée d’historique n’existe plus.
ja: この履歴項目は存在しません。
ko: 이 기록 항목은 더 이상 존재하지 않습니다.
pt_br: Esta entrada do histórico não existe mais.
ru: Эта запись истории больше не существует.
zh_hans: 此历史记录已不存在。

# agentHistory.undoReview.failure.alreadyReverted
source: This entry has already been undone.
de: Dieser Eintrag wurde bereits rückgängig gemacht.
es: Esta entrada ya se ha deshecho.
fr: Cette entrée a déjà été annulée.
ja: この項目はすでに取り消されています。
ko: 이 항목은 이미 실행 취소되었습니다.
pt_br: Esta entrada já foi desfeita.
ru: Эта запись уже отменена.
zh_hans: 此记录已撤销。

# agentHistory.undoReview.failure.notEligible
source: This entry does not contain an eligible verified undo.
de: Dieser Eintrag enthält kein zulässiges verifiziertes Rückgängigmachen.
es: Esta entrada no contiene una operación de deshacer verificada apta.
fr: Cette entrée ne contient aucune annulation vérifiée admissible.
ja: この項目には適用可能な検証済み取り消しがありません。
ko: 이 항목에는 적용 가능한 검증된 실행 취소가 없습니다.
pt_br: Esta entrada não contém um desfazer verificado elegível.
ru: В записи нет допустимой подтверждённой операции отмены.
zh_hans: 此记录不包含符合条件的已验证撤销。

# agentHistory.undoReview.failure.authorityMissing
source: The private undo authority is missing.
de: Die private Rückgängig-Autorisierung fehlt.
es: Falta la autorización privada para deshacer.
fr: L’autorisation privée d’annulation est manquante.
ja: 非公開の取り消し権限が見つかりません。
ko: 비공개 실행 취소 권한이 없습니다.
pt_br: A autoridade privada de desfazer está ausente.
ru: Отсутствует закрытое разрешение на отмену.
zh_hans: 缺少私有撤销授权。

# agentHistory.undoReview.failure.authorityConsumed
source: This undo authority has already been used.
de: Diese Rückgängig-Autorisierung wurde bereits verwendet.
es: Esta autorización para deshacer ya se ha utilizado.
fr: Cette autorisation d’annulation a déjà été utilisée.
ja: この取り消し権限はすでに使用されています。
ko: 이 실행 취소 권한은 이미 사용되었습니다.
pt_br: Esta autoridade de desfazer já foi usada.
ru: Это разрешение на отмену уже использовано.
zh_hans: 此撤销授权已被使用。

# agentHistory.undoReview.failure.workspaceChanged
source: The workspace root, HEAD, or Git index changed after capture.
de: Arbeitsbereichswurzel, HEAD oder Git-Index haben sich seit der Erfassung geändert.
es: La raíz del espacio de trabajo, HEAD o el índice de Git cambiaron después de la captura.
fr: La racine de l’espace de travail, HEAD ou l’index Git a changé après la capture.
ja: 取得後にワークスペースルート、HEAD、または Git インデックスが変更されました。
ko: 캡처 후 작업 공간 루트, HEAD 또는 Git 인덱스가 변경되었습니다.
pt_br: A raiz do espaço de trabalho, o HEAD ou o índice do Git mudou após a captura.
ru: После снимка изменились корень рабочей области, HEAD или индекс Git.
zh_hans: 捕获后，工作区根目录、HEAD 或 Git 索引发生了变化。
